
Процедура ВыполнитьРегистрацию(Логин, Телефон) Экспорт
	Соединение		= Новый HTTPСоединение("192.168.1.120",,"MobileClient");
	Запрос			= Новый HTTPЗапрос("avtoservis/hs/users/registerGetUser?username="+ Логин + "&phone=" + Телефон);
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния = 200 Тогда
		ДанныеПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
	ИначеЕсли Ответ.КодСостояния = 409 Тогда
		Сообщить("Пользователь " + Логин +" уже существует!");
	Иначе
		Сообщить("При попытке аутентификации произошла ошибка!");
	КонецЕсли;
КонецПроцедуры
