
&НаКлиенте
Процедура СформироватьНаименование()
	
	Если ЗначениеЗаполнено(Объект.Модель)И ЗначениеЗаполнено(Объект.VIN) Тогда
		Объект.Наименование = Строка(Объект.Модель) + " (VIN: " + Объект.VIN + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Модель) И НЕ ЗначениеЗаполнено(Объект.VIN) Тогда
		Объект.Наименование = Строка(Объект.Модель);
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Модель) И ЗначениеЗаполнено(Объект.VIN) Тогда
		Объект.Наименование = "(VIN: " + Объект.VIN + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура VINПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименование();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Владелец.ТипКонтрагента <> ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель") Тогда
		Отказ = Истина;
		Сообщить("Владелец может быть только контрагентом с типом Покупатель!");
	КонецЕсли;
	
КонецПроцедуры


