
&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе 
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ПроверитьДлинуИНН(Объект.ИНН, Объект.ТипОрганизации);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДлинуИНН(ИНН, ТипОрганизации)
	
	Если ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") 
		И СтрДлина(ИНН) <> 10 Тогда
		Сообщить("Для Юридического лица длина реквизита ИНН должна быть 10 символов.");
		Возврат Ложь;
	ИначеЕсли ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") 
		И СтрДлина(ИНН) <> 12 Тогда
		Сообщить("Для индивидуального предпринимателя длина реквизита ИНН должна быть 12 символов.");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ИНН = Объект.ИНН;
	ТипОрганизации = Объект.ТипОрганизации;
	
	Если НЕ ПроверитьДлинуИНН(ИНН, ТипОрганизации) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры



