
Процедура ВыполнитьАутентификацию(Логин) Экспорт
	Соединение		= Новый HTTPСоединение("192.168.1.120",,"MobileClient");
	Запрос			= Новый HTTPЗапрос("avtoservis/hs/users/getUser?username="+Логин);
	Ответ			= Соединение.Получить(Запрос);
	Если Ответ.КодСостояния = 200 Тогда
		ДанныеПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		АвторизоватьПользователя(ДанныеПользователя);
	ИначеЕсли Ответ.КодСостояния = 401 Тогда
		Сообщить("По логину " + Логин +" пользователь не найден!");
	Иначе
		Сообщить("При попытке аутентификации произошла ошибка!");
	КонецЕсли;
КонецПроцедуры

Процедура АвторизоватьПользователя(ДанныеПользователя) Экспорт
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = ДанныеПользователя.name;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
	НовыйПользовательИБ.Записать();
	
	ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя.name);
	Если ТекущийПользователь.Пустая() Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
		НовыйПользователь.ВнешнийGUID = ДанныеПользователя.code;
		НовыйПользователь.Наименование = ДанныеПользователя.name;
		НовыйПользователь.Записать();
		ТекущийПользователь = НовыйПользователь.Ссылка;
	Иначе 
		ТекПользОбъект = ТекущийПользователь.ПолучитьОбъект();
		ТекПользОбъект.Код = НовыйПользовательИБ.УникальныйИдентификатор;
		ТекПользОбъект.Записать();
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
	
КонецПроцедуры

Процедура Разлогиниться() Экспорт 
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда 
		ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();
	КонецЕсли;
КонецПроцедуры