
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ЗаказКлиента = ЭтотОбъект.Ссылка;
	Движение.Сумма = ЭтотОбъект.Услуги.Итог("Сумма");
	
	Движения.МатериалыЗаказчиков.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалыЗаказчика Из МатериалыЗаказчика Цикл
		Движение = Движения.МатериалыЗаказчиков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМатериалыЗаказчика.Номенклатура;
		Движение.Заказчик = Клиент;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаМатериалыЗаказчика.Количество;
	КонецЦикла;
	
КонецПроцедуры
