
&НаКлиенте
Процедура СформироватьФИО()
	
	Если НЕ ЗначениеЗаполнено(Объект.Отчество) Тогда
		Если ЗначениеЗаполнено(Объект.Имя) 
			И ЗначениеЗаполнено(Объект.Фамилия) Тогда
			Объект.Наименование = Объект.Фамилия + " " + Объект.Имя;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Имя)
			И ЗначениеЗаполнено(Объект.Фамилия) Тогда
			Объект.Наименование = Объект.Фамилия;
		Иначе 
			Объект.Наименование = Объект.Имя;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Имя) Тогда
		Если ЗначениеЗаполнено(Объект.Фамилия) 
			И ЗначениеЗаполнено(Объект.Отчество) Тогда
			Объект.Наименование = Объект.Фамилия + " " + Объект.Отчество;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Фамилия)
			И ЗначениеЗаполнено(Объект.Отчество) Тогда
			Объект.Наименование = Объект.Отчество;
		Иначе
			Объект.Наименование = Объект.Фамилия;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Фамилия)Тогда
		Если ЗначениеЗаполнено(Объект.Имя) 
			И ЗначениеЗаполнено(Объект.Отчество) Тогда
			Объект.Наименование = Объект.Имя + " " + Объект.Отчество;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Имя)
			И ЗначениеЗаполнено(Объект.Отчество) Тогда
			Объект.Наименование = Объект.Отчество;
		Иначе
			Объект.Наименование = Объект.Имя;
		КонецЕсли;
		
	Иначе
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьФИО();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры
